
// 1.Даны переменные a = 10 и b = 3. Найдите остаток от деления a на b.
// 2.Возведите 2 в 10 степень. Результат запишите в переменную st. 
// 3.Имеется три переменные a = 1, b = 2, c = " белых медведей". Сложите переменные так, чтобы в результате получилось выражение: "12 белых медведей". 
// 4..Запустив следующий код, вы получите число 16. Что нужно изменить, чтобы получить число 15? let a = 5; let b = 10, let c ; c = ++a + b--; 
// 5. Запустив следующий код, вы получите число 30. Ваша задача расставить приоритетные скобки () так, чтобы получить число -390. const x = 15 * 4 + 25 - 55; 


// #1
// let a = 10;
// let b = 3;

// console.log(a % b);


// #2
// let a = 2**10;
// let st = a;

// console.log(st);


// #3
// let a = 1;
// let b = 2;
// let c = " белых медведей";
// let d = String (a) + String (b);

// console.log(d + c);


// #4
// let a = 5;
// let b = 10;
// let c;
// c = a + b;

// console.log(c);


// #5
// const x = 15 * (4 + 25 - 55);

// console.log(x);


// Доп. задания:
// 1.Напишите скрипт, который находит площадь прямоугольника высота 23см. (в числовую переменную height), шириной 10см (в числовую переменную width), значение площади должно хранится в числовой переменной s. 
// 2.Напиши скрипт, который находит объем цилиндра высотой 10м (переменная heightC) и диаметром основания 4м (dC), результат поместите в переменную v. 
// 3. Даны размер ипотечного кредита (S — 2 млн.сом), процентная ставка (p — 10%), кол-во лет (years — 5). Найти переплату по кредиту, значение переплаты должно содержаться в переменной perepl.


// #1
// let h = 10, w = 23;
// let s = h*w;

// console.log(s);


// #2
// let d = 4;
// let h = 10;

// console.log(Math.PI * d * h)

// #3
// let s = 2000000;
// let p = 100 * 10;
// let years = 5;
// let perepl = years * s - p;

// console.log(perepl);

